# MSDE631 SQL-NoSQL | Regis University
### Instructor: Dr. Busch

TITLE  | Date | Author |   Notes |
:-----:|:----:|:------:|:-------:|
Project 6: MongoDB Aggregate |17 April 2023 | Ken Dizon | 

**TASK / Content**
1. import empData.csv (file is attached).empdata
    * mongoimport --db db_A7 --collection employees --type=csv --file ‘/empData.csv’ --headerline

2. Write mongo aggregates using PyMongo to answer the following questions:
- Q1: all employees grouped by state and the number of employees in that state
- Q2: average age of people in each state, grouped by state
- Q3: number of people and average age of people in each manager's group, grouped by and sorted by manager id
- Q4: average age and number of employees in each manager group, where the employees ages are > 40, grouped and sorted by manager id

In [1]:
import pymongo
from pymongo import MongoClient
import pprint
import pandas as pd

## 1. Data Import

In [2]:
# loading data
df = pd.read_csv('empdata.csv')
df.head()

   pid   name  managerId state  age  birth  salary
0    1  Mary1          1    WI   24   1995   46436
1    2  Mary2          1    MI   38   1981   68949
2    3  Mary3          1    VT   28   1991   25529
3    4  Mary4          1    MD   38   1981   77397
4    5  Mary5          1    AZ   32   1987   67701

In [3]:
df.tail()

       pid      name  managerId state  age  birth  salary
1995  1996  Mary1996         37    CO   20   1999   84413
1996  1997  Mary1997         30    IA   50   1969   58411
1997  1998  Mary1998         12    AK   43   1976   77986
1998  1999  Mary1999         14    NV   47   1972   15958
1999  2000  Mary2000         98    KY   39   1980   92540

In [4]:
df.shape

(2000, 7)

In [5]:
# Converting into dictionary
empdata = df.to_dict(orient='records')

In [6]:
empdata[:5]

[{'pid': 1,
  'name': 'Mary1',
  'managerId': 1,
  'state': 'WI',
  'age': 24,
  'birth': 1995,
  'salary': 46436},
 {'pid': 2,
  'name': 'Mary2',
  'managerId': 1,
  'state': 'MI',
  'age': 38,
  'birth': 1981,
  'salary': 68949},
 {'pid': 3,
  'name': 'Mary3',
  'managerId': 1,
  'state': 'VT',
  'age': 28,
  'birth': 1991,
  'salary': 25529},
 {'pid': 4,
  'name': 'Mary4',
  'managerId': 1,
  'state': 'MD',
  'age': 38,
  'birth': 1981,
  'salary': 77397},
 {'pid': 5,
  'name': 'Mary5',
  'managerId': 1,
  'state': 'AZ',
  'age': 32,
  'birth': 1987,
  'salary': 67701}]

In [8]:
# Connect to MongoDB
client = MongoClient()
db = client.lab7
employees = db.lab7

# Insert data into MongoDB collection
employees.insert_many(empdata)

In [11]:
emp_count = employees.count_documents({})
print(f"Number of documents in the collection: {emp_count}")

Number of documents in the collection: 2000

## 2. Answer the questions
### Q1: all employees grouped by state and the number of employees in that state

In [13]:
q1 = [
    {'$group': {'_id': '$state', 'count': {'$sum': 1}}},
    {'$sort': {'_id': 1}}
]
result_q1 = employees.aggregate(q1)
for state_num in result_q1:
    print(f"State: {state_num['_id']}, Number of employees: {state_num['count']}")

State: AK, Number of employees: 45
State: AL, Number of employees: 40
State: AZ, Number of employees: 69
State: CA, Number of employees: 45
State: CO, Number of employees: 38
State: CT, Number of employees: 43
State: DE, Number of employees: 39
State: FL, Number of employees: 40
State: GA, Number of employees: 45
State: HI, Number of employees: 34
State: IA, Number of employees: 42
State: ID, Number of employees: 47
State: IL, Number of employees: 43
State: IN, Number of employees: 42
State: KS, Number of employees: 29
State: KY, Number of employees: 39
State: LA, Number of employees: 45
State: MA, Number of employees: 44
State: MD, Number of employees: 44
State: ME, Number of employees: 36
State: MI, Number of employees: 37
State: MN, Number of employees: 31
State: MO, Number of employees: 42
State: MS, Number of employees: 46
State: MT, Number of employees: 41
State: NC, Number of employees: 47
State: ND, Number of employees: 28
State: NE, Number of employees: 30
State: NH, Number of employees: 26
State: NJ, Number of employees: 43
State: NM, Number of employees: 34
State: NV, Number of employees: 42
State: NY, Number of employees: 57
State: OH, Number of employees: 36
State: OK, Number of employees: 43
State: OR, Number of employees: 37
State: PA, Number of employees: 31
State: RI, Number of employees: 35
State: SC, Number of employees: 41
State: SD, Number of employees: 46
State: TN, Number of employees: 52
State: TX, Number of employees: 48
State: UT, Number of employees: 45
State: VA, Number of employees: 34
State: VT, Number of employees: 38
State: WA, Number of employees: 48
State: WI, Number of employees: 32
State: WV, Number of employees: 37
State: WY, Number of employees: 44

### Q2: Average age of people in each state, grouped by state

In [15]:
q2 = [
    {'$group': {'_id': '$state', 'avg_age': {'$avg': '$age'}}},
    {'$sort': {'_id': 1}}
]
result_q2 = employees.aggregate(q2)
for avg_age_state in result_q2:
    print(f"State: {avg_age_state ['_id']}, Average age: {avg_age_state ['avg_age']}")

State: AK, Average age: 45.4
State: AL, Average age: 46.025
State: AZ, Average age: 46.79710144927536
State: CA, Average age: 40.13333333333333
State: CO, Average age: 42.05263157894737
State: CT, Average age: 40.23255813953488
State: DE, Average age: 39.17948717948718
State: FL, Average age: 36.65
State: GA, Average age: 40.666666666666664
State: HI, Average age: 41.64705882352941
State: IA, Average age: 43.95238095238095
State: ID, Average age: 41.212765957446805
State: IL, Average age: 43.46511627906977
State: IN, Average age: 41.166666666666664
State: KS, Average age: 43.55172413793103
State: KY, Average age: 44.02564102564103
State: LA, Average age: 41.977777777777774
State: MA, Average age: 38.27272727272727
State: MD, Average age: 43.54545454545455
State: ME, Average age: 42.25
State: MI, Average age: 43.75675675675676
State: MN, Average age: 38.16129032258065
State: MO, Average age: 42.595238095238095
State: MS, Average age: 40.630434782608695
State: MT, Average age: 40.073170731707314
State: NC, Average age: 43.1063829787234
State: ND, Average age: 40.0
State: NE, Average age: 40.3
State: NH, Average age: 42.65384615384615
State: NJ, Average age: 42.883720930232556
State: NM, Average age: 39.8235294117647
State: NV, Average age: 41.166666666666664
State: NY, Average age: 40.96491228070175
State: OH, Average age: 41.69444444444444
State: OK, Average age: 46.06976744186046
State: OR, Average age: 42.486486486486484
State: PA, Average age: 43.83870967741935
State: RI, Average age: 45.114285714285714
State: SC, Average age: 41.90243902439025
State: SD, Average age: 39.80434782608695
State: TN, Average age: 40.71153846153846
State: TX, Average age: 44.625
State: UT, Average age: 44.333333333333336
State: VA, Average age: 45.0
State: VT, Average age: 40.26315789473684
State: WA, Average age: 39.9375
State: WI, Average age: 40.125
State: WV, Average age: 46.62162162162162
State: WY, Average age: 41.34090909090909

### Q3: number of people and average age of people in each manager's group, grouped by and sorted by manager id

In [17]:
q3 = [
    {'$group': {'_id': '$managerId', 'count': {'$sum': 1}, 'avg_age': {'$avg': '$age'}}},
    {'$sort': {'_id': 1}}
]
result_q3 = employees.aggregate(q3)
for ppl_group in result_q3:
    print(f"Manager ID: {ppl_group['_id']}, Number of people: {ppl_group['count']}, Average age: {ppl_group['avg_age']}")

Manager ID: 1, Number of people: 100, Average age: 41.64
Manager ID: 2, Number of people: 26, Average age: 39.80769230769231
Manager ID: 3, Number of people: 22, Average age: 43.5
Manager ID: 4, Number of people: 19, Average age: 45.78947368421053
Manager ID: 5, Number of people: 32, Average age: 43.40625
Manager ID: 6, Number of people: 17, Average age: 37.705882352941174
Manager ID: 7, Number of people: 20, Average age: 39.25
Manager ID: 8, Number of people: 19, Average age: 42.94736842105263
Manager ID: 9, Number of people: 18, Average age: 45.05555555555556
Manager ID: 10, Number of people: 13, Average age: 44.61538461538461
Manager ID: 11, Number of people: 21, Average age: 42.904761904761905
Manager ID: 12, Number of people: 16, Average age: 41.0
Manager ID: 13, Number of people: 18, Average age: 39.888888888888886
Manager ID: 14, Number of people: 25, Average age: 41.72
Manager ID: 15, Number of people: 21, Average age: 42.333333333333336
Manager ID: 16, Number of people: 18, Average age: 36.77777777777778
Manager ID: 17, Number of people: 16, Average age: 44.25
Manager ID: 18, Number of people: 14, Average age: 38.785714285714285
Manager ID: 19, Number of people: 23, Average age: 44.04347826086956
Manager ID: 20, Number of people: 12, Average age: 41.583333333333336
Manager ID: 21, Number of people: 16, Average age: 49.6875
Manager ID: 22, Number of people: 16, Average age: 43.9375
Manager ID: 23, Number of people: 19, Average age: 42.1578947368421
Manager ID: 24, Number of people: 18, Average age: 39.833333333333336
Manager ID: 25, Number of people: 27, Average age: 42.55555555555556
Manager ID: 26, Number of people: 24, Average age: 43.083333333333336
Manager ID: 27, Number of people: 21, Average age: 42.76190476190476
Manager ID: 28, Number of people: 23, Average age: 44.21739130434783
Manager ID: 29, Number of people: 16, Average age: 36.1875
Manager ID: 30, Number of people: 19, Average age: 42.8421052631579
Manager ID: 31, Number of people: 26, Average age: 40.61538461538461
Manager ID: 32, Number of people: 22, Average age: 42.90909090909091
Manager ID: 33, Number of people: 16, Average age: 36.9375
Manager ID: 34, Number of people: 22, Average age: 45.72727272727273
Manager ID: 35, Number of people: 19, Average age: 42.68421052631579
Manager ID: 36, Number of people: 18, Average age: 44.55555555555556
Manager ID: 37, Number of people: 19, Average age: 40.63157894736842
Manager ID: 38, Number of people: 19, Average age: 34.421052631578945
Manager ID: 39, Number of people: 16, Average age: 39.25
Manager ID: 40, Number of people: 17, Average age: 40.94117647058823
Manager ID: 41, Number of people: 16, Average age: 40.875
Manager ID: 42, Number of people: 19, Average age: 45.89473684210526
Manager ID: 43, Number of people: 26, Average age: 43.69230769230769
Manager ID: 44, Number of people: 24, Average age: 41.541666666666664
Manager ID: 45, Number of people: 20, Average age: 46.1
Manager ID: 46, Number of people: 21, Average age: 44.42857142857143
Manager ID: 47, Number of people: 16, Average age: 42.0
Manager ID: 48, Number of people: 9, Average age: 44.22222222222222
Manager ID: 49, Number of people: 17, Average age: 46.23529411764706
Manager ID: 50, Number of people: 17, Average age: 39.05882352941177
Manager ID: 51, Number of people: 19, Average age: 43.8421052631579
Manager ID: 52, Number of people: 22, Average age: 42.09090909090909
Manager ID: 53, Number of people: 18, Average age: 41.611111111111114
Manager ID: 54, Number of people: 17, Average age: 36.88235294117647
Manager ID: 55, Number of people: 15, Average age: 47.06666666666667
Manager ID: 56, Number of people: 19, Average age: 39.73684210526316
Manager ID: 57, Number of people: 19, Average age: 40.94736842105263
Manager ID: 58, Number of people: 15, Average age: 37.733333333333334
Manager ID: 59, Number of people: 20, Average age: 40.65
Manager ID: 60, Number of people: 21, Average age: 48.095238095238095
Manager ID: 61, Number of people: 16, Average age: 42.3125
Manager ID: 62, Number of people: 16, Average age: 38.6875
Manager ID: 63, Number of people: 20, Average age: 40.2
Manager ID: 64, Number of people: 14, Average age: 44.142857142857146
Manager ID: 65, Number of people: 17, Average age: 45.470588235294116
Manager ID: 66, Number of people: 18, Average age: 44.27777777777778
Manager ID: 67, Number of people: 23, Average age: 44.34782608695652
Manager ID: 68, Number of people: 20, Average age: 39.3
Manager ID: 69, Number of people: 13, Average age: 38.15384615384615
Manager ID: 70, Number of people: 20, Average age: 47.15
Manager ID: 71, Number of people: 20, Average age: 44.95
Manager ID: 72, Number of people: 19, Average age: 42.473684210526315
Manager ID: 73, Number of people: 20, Average age: 42.1
Manager ID: 74, Number of people: 20, Average age: 42.95
Manager ID: 75, Number of people: 25, Average age: 38.88
Manager ID: 76, Number of people: 14, Average age: 37.285714285714285
Manager ID: 77, Number of people: 22, Average age: 42.27272727272727
Manager ID: 78, Number of people: 18, Average age: 36.388888888888886
Manager ID: 79, Number of people: 23, Average age: 37.34782608695652
Manager ID: 80, Number of people: 15, Average age: 46.333333333333336
Manager ID: 81, Number of people: 21, Average age: 44.42857142857143
Manager ID: 82, Number of people: 16, Average age: 37.625
Manager ID: 83, Number of people: 15, Average age: 38.46666666666667
Manager ID: 84, Number of people: 21, Average age: 44.42857142857143
Manager ID: 85, Number of people: 21, Average age: 35.0
Manager ID: 86, Number of people: 21, Average age: 40.333333333333336
Manager ID: 87, Number of people: 26, Average age: 49.42307692307692
Manager ID: 88, Number of people: 19, Average age: 41.473684210526315
Manager ID: 89, Number of people: 30, Average age: 44.5
Manager ID: 90, Number of people: 18, Average age: 37.833333333333336
Manager ID: 91, Number of people: 20, Average age: 46.4
Manager ID: 92, Number of people: 9, Average age: 52.44444444444444
Manager ID: 93, Number of people: 23, Average age: 46.21739130434783
Manager ID: 94, Number of people: 15, Average age: 45.93333333333333
Manager ID: 95, Number of people: 26, Average age: 44.96153846153846
Manager ID: 96, Number of people: 17, Average age: 40.8235294117647
Manager ID: 97, Number of people: 18, Average age: 46.5
Manager ID: 98, Number of people: 19, Average age: 32.578947368421055
Manager ID: 99, Number of people: 18, Average age: 38.611111111111114
Manager ID: 100, Number of people: 21, Average age: 42.285714285714285

### Q4: average age and number of employees in each manager group, where the employees ages are > 40, grouped and sorted by manager id

In [18]:
q4 = [
    {'$match': {'age': {'$gt': 40}}},
    {'$group': {'_id': '$managerId', 'count': {'$sum': 1}, 'avg_age': {'$avg': '$age'}}},
    {'$sort': {'_id': 1}}
]
result_q4 = employees.aggregate(q4)
for ppl_group_40 in result_q4:
    print(f"Manager ID: {ppl_group_40['_id']}, Number of employees: {ppl_group_40['count']}, Average age: {ppl_group_40['avg_age']}")

Manager ID: 1, Number of employees: 51, Average age: 53.666666666666664
Manager ID: 2, Number of employees: 13, Average age: 52.07692307692308
Manager ID: 3, Number of employees: 14, Average age: 55.42857142857143
Manager ID: 4, Number of employees: 11, Average age: 54.63636363636363
Manager ID: 5, Number of employees: 19, Average age: 54.1578947368421
Manager ID: 6, Number of employees: 8, Average age: 49.0
Manager ID: 7, Number of employees: 8, Average age: 52.75
Manager ID: 8, Number of employees: 13, Average age: 51.76923076923077
Manager ID: 9, Number of employees: 11, Average age: 56.63636363636363
Manager ID: 10, Number of employees: 10, Average age: 48.5
Manager ID: 11, Number of employees: 11, Average age: 55.72727272727273
Manager ID: 12, Number of employees: 9, Average age: 51.888888888888886
Manager ID: 13, Number of employees: 9, Average age: 53.333333333333336
Manager ID: 14, Number of employees: 12, Average age: 55.333333333333336
Manager ID: 15, Number of employees: 11, Average age: 54.90909090909091
Manager ID: 16, Number of employees: 7, Average age: 49.142857142857146
Manager ID: 17, Number of employees: 10, Average age: 53.5
Manager ID: 18, Number of employees: 5, Average age: 53.2
Manager ID: 19, Number of employees: 15, Average age: 51.06666666666667
Manager ID: 20, Number of employees: 7, Average age: 51.714285714285715
Manager ID: 21, Number of employees: 13, Average age: 53.07692307692308
Manager ID: 22, Number of employees: 9, Average age: 53.666666666666664
Manager ID: 23, Number of employees: 11, Average age: 52.27272727272727
Manager ID: 24, Number of employees: 10, Average age: 48.6
Manager ID: 25, Number of employees: 14, Average age: 52.785714285714285
Manager ID: 26, Number of employees: 13, Average age: 54.07692307692308
Manager ID: 27, Number of employees: 10, Average age: 56.1
Manager ID: 28, Number of employees: 12, Average age: 55.666666666666664
Manager ID: 29, Number of employees: 5, Average age: 49.4
Manager ID: 30, Number of employees: 10, Average age: 54.4
Manager ID: 31, Number of employees: 12, Average age: 52.5
Manager ID: 32, Number of employees: 12, Average age: 53.75
Manager ID: 33, Number of employees: 6, Average age: 48.833333333333336
Manager ID: 34, Number of employees: 14, Average age: 54.92857142857143
Manager ID: 35, Number of employees: 12, Average age: 50.916666666666664
Manager ID: 36, Number of employees: 11, Average age: 53.27272727272727
Manager ID: 37, Number of employees: 9, Average age: 53.22222222222222
Manager ID: 38, Number of employees: 6, Average age: 51.666666666666664
Manager ID: 39, Number of employees: 7, Average age: 54.57142857142857
Manager ID: 40, Number of employees: 8, Average age: 54.375
Manager ID: 41, Number of employees: 9, Average age: 51.77777777777778
Manager ID: 42, Number of employees: 12, Average age: 53.666666666666664
Manager ID: 43, Number of employees: 14, Average age: 58.42857142857143
Manager ID: 44, Number of employees: 11, Average age: 55.72727272727273
Manager ID: 45, Number of employees: 13, Average age: 53.46153846153846
Manager ID: 46, Number of employees: 12, Average age: 53.166666666666664
Manager ID: 47, Number of employees: 8, Average age: 53.125
Manager ID: 48, Number of employees: 5, Average age: 56.4
Manager ID: 49, Number of employees: 12, Average age: 53.416666666666664
Manager ID: 50, Number of employees: 7, Average age: 49.142857142857146
Manager ID: 51, Number of employees: 11, Average age: 57.27272727272727
Manager ID: 52, Number of employees: 12, Average age: 55.416666666666664
Manager ID: 53, Number of employees: 9, Average age: 54.77777777777778
Manager ID: 54, Number of employees: 6, Average age: 55.0
Manager ID: 55, Number of employees: 9, Average age: 58.0
Manager ID: 56, Number of employees: 9, Average age: 53.888888888888886
Manager ID: 57, Number of employees: 9, Average age: 55.22222222222222
Manager ID: 58, Number of employees: 7, Average age: 50.142857142857146
Manager ID: 59, Number of employees: 10, Average age: 53.3
Manager ID: 60, Number of employees: 12, Average age: 58.583333333333336
Manager ID: 61, Number of employees: 8, Average age: 50.875
Manager ID: 62, Number of employees: 9, Average age: 50.44444444444444
Manager ID: 63, Number of employees: 10, Average age: 55.1
Manager ID: 64, Number of employees: 8, Average age: 52.875
Manager ID: 65, Number of employees: 11, Average age: 54.90909090909091
Manager ID: 66, Number of employees: 10, Average age: 55.3
Manager ID: 67, Number of employees: 15, Average age: 52.53333333333333
Manager ID: 68, Number of employees: 9, Average age: 49.333333333333336
Manager ID: 69, Number of employees: 4, Average age: 51.75
Manager ID: 70, Number of employees: 14, Average age: 56.5
Manager ID: 71, Number of employees: 10, Average age: 55.1
Manager ID: 72, Number of employees: 10, Average age: 56.1
Manager ID: 73, Number of employees: 11, Average age: 51.81818181818182
Manager ID: 74, Number of employees: 10, Average age: 56.0
Manager ID: 75, Number of employees: 11, Average age: 50.45454545454545
Manager ID: 76, Number of employees: 7, Average age: 47.285714285714285
Manager ID: 77, Number of employees: 11, Average age: 56.18181818181818
Manager ID: 78, Number of employees: 7, Average age: 49.0
Manager ID: 79, Number of employees: 10, Average age: 51.1
Manager ID: 80, Number of employees: 11, Average age: 51.18181818181818
Manager ID: 81, Number of employees: 11, Average age: 54.90909090909091
Manager ID: 82, Number of employees: 5, Average age: 52.8
Manager ID: 83, Number of employees: 6, Average age: 51.5
Manager ID: 84, Number of employees: 13, Average age: 52.53846153846154
Manager ID: 85, Number of employees: 8, Average age: 50.375
Manager ID: 86, Number of employees: 10, Average age: 54.7
Manager ID: 87, Number of employees: 19, Average age: 57.0
Manager ID: 88, Number of employees: 10, Average age: 55.9
Manager ID: 89, Number of employees: 19, Average age: 54.26315789473684
Manager ID: 90, Number of employees: 7, Average age: 56.42857142857143
Manager ID: 91, Number of employees: 14, Average age: 55.0
Manager ID: 92, Number of employees: 8, Average age: 55.125
Manager ID: 93, Number of employees: 14, Average age: 55.785714285714285
Manager ID: 94, Number of employees: 11, Average age: 53.36363636363637
Manager ID: 95, Number of employees: 15, Average age: 55.0
Manager ID: 96, Number of employees: 10, Average age: 49.2
Manager ID: 97, Number of employees: 13, Average age: 54.38461538461539
Manager ID: 98, Number of employees: 6, Average age: 48.5
Manager ID: 99, Number of employees: 7, Average age: 54.285714285714285
Manager ID: 100, Number of employees: 11, Average age: 53.09090909090909